<?php

namespace App\Modules;

class CharacterConverter
{
    /**
     * チェック文字を通常アルファベットに変換する
     *
     * @param string $str
     * @return string
     */
    public static function convertToAlphabet(string $str): string
    {
        $map = [
            'Š' => 'S', 'š' => 's',
            'Đ' => 'Dj','đ' => 'dj',
            'Ž' => 'Z', 'ž' => 'z',
            'Č' => 'C', 'č' => 'c',
            'Ć' => 'C', 'ć' => 'c',
            'À' => 'A', 'Á' => 'A', 'Â' => 'A', 'Ã' => 'A', 'Ä' => 'A', 'Å' => 'A',
            'à' => 'a', 'á' => 'a', 'â' => 'a', 'ã' => 'a', 'ä' => 'a', 'å' => 'a',
            'È' => 'E', 'É' => 'E', 'Ê' => 'E', 'Ë' => 'E',
            'è' => 'e', 'é' => 'e', 'ê' => 'e', 'ë' => 'e',
            'Ì' => 'I', 'Í' => 'I', 'Î' => 'I', 'Ï' => 'I',
            'ì' => 'i', 'í' => 'i', 'î' => 'i', 'ï' => 'i',
            'Ò' => 'O', 'Ó' => 'O', 'Ô' => 'O', 'Õ' => 'O', 'Ö' => 'O', 'Ø' => 'O',
            'ò' => 'o', 'ó' => 'o', 'ô' => 'o', 'õ' => 'o', 'ö' => 'o', 'ø' => 'o',
            'Ù' => 'U', 'Ú' => 'U', 'Û' => 'U', 'Ü' => 'U',
            'ù' => 'u', 'ú' => 'u', 'û' => 'u', 'ü' => 'u',
            'Ý' => 'Y', 'ý' => 'y', 'ÿ' => 'y', 'Ŕ' => 'R', 'ŕ' => 'r',
            'Ñ' => 'N', 'ñ' => 'n',
            'Ç' => 'C', 'ç' => 'c',
        ];
        $str = strtr($str, $map);
        // アルファベットと数字、スペース以外の文字を取り除く
        return preg_replace('/[^a-zA-Z0-9 ]/', '', $str);
    }
}